from math import *

try:
    x = input('Введите x(использовать "."):')
    y = input('Введите y(использовать "."):')
    x = float(x)
    y = float(y)

    if abs(x+y) == 0:
        print('Ошибка: деление на ноль. Введите корректные данные.')
    else:
        z = (3.14/2) - sqrt(2*x) - ((x + y**2)/(0.75*tan(abs(x+y))))
        k = round(z)
        l = int(z)
        print('Вещественное число =', round(z*1000)/1000)
        print('Целая часть результата (неявно) К =', k)
        print('Целая часть результата (явно) L =', l)
        print('Округление в большую сторону =', ceil(z))
        print('Округление в меньшую сторону =', floor(z))
        print('Значение альтернативы префиксного инкремента =', k + 1)
        print('Значение постфиксного инкремента на языке Python неидентично значению того же инкремента на языке Visual C++')

except ValueError:
    print('Ошибка: неверный тип данных. Введите корректные данные.')